import time

print('Король и шут "Воспоминания о былой любви"')
time.sleep(36) #
print("Дремлет за горой мрачный замок мой") 
time.sleep(8) #
print("Душу мучает порой царящий в нём покой") 
time.sleep(7) #
print("Я в своих фантазий страждущий герой") 
time.sleep(8) #
print("А любви моей живой все образы со мной") 
time.sleep(8) #


print("Я часто вижу страх в смотрящих на меня глазах") 
time.sleep(5) #
print("Им суждено уснуть в моих стенах") 
time.sleep(8) #
print("Застыть в моих мирах") 
time.sleep(4) #
print("Но сердце от любви горит, моя душа болит") 
time.sleep(6) # 
print("И восковых фигур прекрасен вид") 
time.sleep(7) #
print("Покой везде царит!") 
time.sleep(8) #


print("Я их приводил в свой прекрасный дом")
time.sleep(8) #
print("Их вином поил и развлекались мы потом")
time.sleep(9) # 
print("Иногда у них лёгкий был испуг")
time.sleep(8) #
print("От прикосновений к нежной шее крепких рук")
time.sleep(8) #


print("Я часто вижу страх в смотрящих на меня глазах")
time.sleep(6) #
print("Им суждено уснуть в моих стенах")
time.sleep(7) # 
print("Застыть в моих мирах")
time.sleep(4) #
print("Но сердце от любви горит, моя душа болит")
time.sleep(7) #
print("И восковых фигур прекрасен вид")
time.sleep(6) #
print("Покой везде царит!")
time.sleep(42) #


print("Вот несёт одна мне свои цветы")
time.sleep(6) #
print("Вот стоит другая, погружённая в мечты")
time.sleep(7) #
print("Я пытался их до смерти рассмешить")
time.sleep(6) #
print("Но пришлось, как в старой сказке просто задушить!")
time.sleep(8) #


print("Я часто вижу страх в смотрящих на меня глазах")
time.sleep(6) #
print("Им суждено уснуть в моих стенах")
time.sleep(6) #
print("Застыть в моих мирах")
time.sleep(5)
print("Но сердце от любви горит, моя душа болит")
time.sleep(7)
print("И восковых фигур прекрасен вид")
time.sleep(8)
print("Покой везде царит!")
