lenght = 5

breadth = 2 

area = lenght * breadth

print("Площадь равна: ", area)
print("Периметр равен: ", 2 * (lenght + breadth))

# Как это работает:
# Длина и ширина прямоугольника хранятся в переменных length и breadth
# соответственно. Мы используем их для вычисления периметра и площади
# прямоугольника при помощи выражений. Результат выражения length *
# breadth сохраняется в переменной area, после чего выводится на экран
# функцией print. Во втором случае мы напрямую подставляем значение выражения 2 * (length + breadth) в функцию print.
# Также обратите внимание, как Python «красиво печатает» результат. Несмотря на то, что мы не указали пробела между 'Площадь равна' и переменной area, Python подставляет его за нас, чтобы получить красивый и понятный вывод. Программа же остаётся при этом легкочитаемой (поскольку нам
# не нужно заботиться о пробелах между строками, которые мы выводим). Это
# пример того, как Python облегчает жизнь программисту.
