def sayHello():
    print("Привет мир!") # блок принадлежащий функции 
# конец функции 
sayHello() # вызов функции# 
sayHello() # ещё один вызов функции

# Мы определили функцию с именем sayHello, используя описанный выше
# синтаксис. Эта функция не принимает параметров, поэтому в скобках не
#  объявлены какие-либо переменные. Параметры функции – это некие входные#
#  данные, которые мы можем передать функции, чтобы получить соответствующий им результат.
# Обратите внимание, что мы можем вызывать одну и ту же функцию много#раз, 
# а значит нет необходимости писать один и тот же код снова и снова.
